"""3) დაწერეთ პროგრამა რომელიც მიიღებს ნატურალურ რიცხვ n-ს, რომელიც არ აღემატება 100-ს.
პროგრამამ უნდა შექმნას ფიბონაჩის მიმდევრობის პირველი n წევრისგან შემდგარი სია და დაბეჭდოს ეკრანზე.
ფიბონაჩის მიმდევრობა არის მიმდევრობა რომელშიც პირველი წევრია 0, მეორე წევრია 1,
ხოლო ყოველი შემდეგი წევრი ტოლია წინა ორი წევრის ჯამის.
"""

list_for_fibonaci = [0, 1]
i =2

'''
ეს ამოწმებს მომხარებელი კეთილსინდისიერად იყენებს თუ არა პროგრამას ანუ 0 დან 100 რიცხვის შუაკლედში ირჩევს თუ არა რიცხვს 
'''

ricxvi = int(input("შემოიტანე რაიმე ნატურარული რიცხვი (1-100): "))

while  ricxvi<=0 or ricxvi>100:
    ricxvi = int(input("რიცხვი უნდა იყოს დადებითი და 1-100 შუალედში სცადეთ თავიდან: "))

#კოდის  ეს ნაწილი უშვალოდ ითვლის ფიბონაჩის რიცხვებს
while i<ricxvi:
    list_for_fibonaci.append(list_for_fibonaci[i-2] + list_for_fibonaci[i-1])
    i+=1

match ricxvi:
    case 1:
        print("1 წევრისგან შემდარი ფიბონჩის რიცხვია",list_for_fibonaci[0])
    case _:
        print(ricxvi, "წევრისაგან შემდგარი ფიბონაჩის რიცხვების სიაა ", *list_for_fibonaci)











