
#1) დაწერეთ პროგრამა, რომელიც მომხმარებელს მოსთხოვს სამკუთხედის გვერდების შეყვანას და ეკრანზე დაბეჭდავს მის ფართობს და პერიმეტრს.

side_list = [0,0,0] # ვქმნით ლისტს სამკუთხედისთვის

for i in range(len(side_list)):
    gvedri = int(input(f"შემოიტანეთ სამკუთხედის გვერდი {i+1} სიგრძე ")) # მომხმარებლისგან ვიღებთ გვერდების სიგრძეს
    side_list[i] = gvedri # ლისტში ვამატებთ ელემენტებს
    perimetri =sum(side_list) # ვჯამავთ ლისტის ელემენტებს
    samkutxedis_fartobi =  perimetri/2  #სამკუთხედის ფართობი გამოითვლება ფორმულით პრიმეტრი/2

print(f"სამკუთხედის პერიმეტრია ტოლია {perimetri}-სმ") #უბრალოდ ვბეჭდავთ სამკუთხედის პერიმეტრის მნიშვნელობას
print(f"სამკუთხედის ფართობი ტოლია {samkutxedis_fartobi}-სმ^2")  #უბრალოდ ვბეჭდავთ სამკუთხედის ფათობის მნიშვნელობას








