'''
დაწერეთ პროგრამა რომელიც დაადგენს არის თუ არა გზა მიმართულ გრაფში ორ
წერტილს შორის. მიმართული გრაფი ნიშნავს რომ თუ გვაქვს გზა A → B, ეს არ ნიშნავს რომ
გვაქვს გზა B → A. სურათზე გამოსახულია გრაფის ლექსიკონი რომლის გასაღებებიდან
გზა გადის მისი მნიშვნელობის თითოეულ წევრთან. მაგალითად A → B და A → C.
 graph = {
    'A' : ['B', 'C'],
    'B' : ['D'],
    'C' : ['E'],

 }
თუ პროგრამას ვკითხავთ გზას A → E უნდა დააბრუნოს True რადგან შეგვიძლია A → C →
E გზით მივიდეთ. თუ პროგრამას ვკითხავთ გზას C→ D უნდა დააბრუნოს False.
შეადგინეთ ცოტა უფრო დიდი გრაფი და შეამოწმეთ თქვენი კოდის სისწორე მასზე
სხვდასხვა input-ისთვის.

'''

# ვქმნით გრაფს
graph = {
    'A': ['B', 'C', 'F', 'Z'],
    'B': ['J', 'K', 'H'],
    'C': ['E', 'V'],
}

visited_set = set()

def has_path(graph, start, end): # ვქმინთ ფუნქციას რომელსაც გადავცემთ სამ პარამეტრს გრაფს, საწყის ნოდს და დანიშნულების წერტილს
    if start == end: # ვამოწმებთ არის თუ არა გზა ერთი წერტილიდან მეორემდე
        return True
    visited_set.add(start) # აქ ვამატებთ იმ ელემენტებს რომელზეც უკვე ვიყვაით

    ''' 
        ციკლით ვუვლით გრაფის ლექსიკონს საიდანსც ქითი ვიღებთ ვალიეუებს და შემდეგ ამ ვალიეუებს გადაუვლით რიგრიგობით  
    '''
    for node in graph.get(start, []):
        if node not in visited_set: # ვამოწმებთ ვართ თუ არა ნამყოფი ამ ელემენტზე თუ არა რეკურსიულად ვიძახებთ ფუნქციას
            if has_path(graph, node, end): return True # რეკურსიულად ვიძახებთ ფუნქციას
    return False # თუ გრაფში ვერ მოიძებნა გზა ვაბრუნებთ false

print(has_path(graph, 'A', 'E'))
print(has_path(graph, 'A', 'O'))













