'''

დაწერეთ პროგრამა რომელიც წინა ამოცანაში აღწერილი სტრუქტურის ფაილიდან
წაიკითხავს გაყიდვების ინფორმაციას.
a. პროგრამამ უნდა იპოვოს მაქსიმალური შესყიდვის (პროდუქტების რაოდენობით, ერთ
შესყიდვაში) განმხორციელებელი მომხმარებელი, თუ რამდენიმენა, მაშინ
მომხმარებლების სია.
b. პროგრამამ უნდა იპოვოს მაქსმალური შესყიდვის (ყველა შესყიდვის ჯამური
ღირებულებით) განმხორციელებელი მომხმარებელი, თუ რამდენიმენა, მაშინ
მომხმარებლების სია.
c. პროგრამამ უნდა იპოვოს შესყიდვების ღირებულების საშუალო არითმეტიკული.
d. პროგრამამ უნდა იპოვოს შესყიდვების რაოდენობების საშუალო არითმეტიკული.
e. პროგრამამ უნდა იპოვოს ყველაზე დიდი რაოდენობით გაყიდული პროდუქტი, თუ
რამდენიმეა მაშინ, პროდუქტების სია.
ნაპოვნი მონაცემები შეაგროვეთ dict ტიპის ობიექტში და ჩაწერეთ stats.json ფაილში.
დააფორმატეთ stats.json ფაილი ისე, რომ მონაცემები ჩაიწეროს ადვილად წაკითხვადი
ფორმით.

'''