'''
დაწერეთ პროგრამა რომელიც დააგენერირებს 5 ცალ შემთხვევით რიცხვს 1-დან 4-მდე
და ჩაწერს სიაში. პროგრამამ უნდა გადაუაროს სიას და თითოეული ელემენტისთვის ეს
ელემენტი ჩაწეროს ახალ სიაში, იმდენჯერ, რაც არის მისი მნიშვნელობა. დაბეჭდეთ
ახალი სიის სიგრძე და თვითონ სია ეკრანზე.
მაგალითი: ვთქვათ პროგრამამ დააგენერირა სია, [1, 4, 2, 2, 3].
უნდა დაიბეჭდოს
List - [1, 4, 4, 4, 4, 2, 2, 2, 2, 3, 3, 3]
Length - 12
'''

import random

# 5 შემთხვევითი რიცხვი 1-დან 4-მდე
original_list = [random.randint(1, 4) for _ in range(5)]

new_list = []

# თითოეული ელემენტი იმდენჯერ ჩავწეროთ, რა მნიშვნელობაც არის
for num in original_list:
    new_list.extend([num] * num)

print("Original List:", original_list)
print("List -", new_list)
print("Length -", len(new_list))
