'''
პროგრამამ უნდა შეგვაყვანინოს წელიწადი და დაგვიბეჭდოს ნაკიანია თუ არა.
წელიწადი ნაკიანია თუ 400-ზე იყოფა, ან 4-ზე იყოფა მაგრამ 100-ზე არა. პროგრამამ
უნდა მოგთხოვოთ სწორი რიცხვის შეყვანა. მაგალითად, არანატურალური რიცხვის, ან
ციფრების გარდა სხვა სიმბოლოების შეყვანის შემთხვევაში თავიდან უნდა
მოგვთხოვოს რიცხვის შეყვანა.
'''


while True:
    year_input = input("შეიყვანეთ წელი: ").strip()

    if year_input.isdigit():
        year = int(year_input)
        if year > 0:
            break
        else:
            print("წელი უნდა იყოს ნატურალური რიცხვი!")
    else:
        print("გთხოვთ შეიყვანოთ მხოლოდ ციფრები!")

if year % 400 == 0 or (year % 4 == 0 and year % 100 != 0):
    print("ნაკიანია")
else:
    print("არ არის ნაკიანი")
